{
  "Header.Item1": "About Me",
  "Header.Item2": "Experience",
  "Header.Item3": "Projects",
  "Header.Item4": "Contact",
  "Header.cvBtn": "Resume",
  "Header.cvName": "CV_Paul_SoftwareEngineer.pdf",

  "Banner.Pretitle": "Hello! My name is",
  "Banner.Description": "I am a dedicated software engineering student with <span class='underline'>expertise in full-stack development</span>, machine learning, and data analysis. I am passionate about building scalable and innovative applications using <span class='underline'>Dart/Flutter</span>, <span class='underline'>Java</span>, and <span class='underline'>Python</span>, while adhering to clean coding practices and development standards.",
  "Banner.ActionBtn": "Say Hi",

  "AboutMe.Title": "About Me",
  "AboutMe.Paragraphs": [
    "As a third-year software engineering student, I have gained hands-on experience in <span class='underline'>mobile app development</span>, <span class='underline'>AI-powered solutions</span>, and <span class='underline'>data-driven projects</span>. My journey includes crafting innovative applications and contributing to impactful projects in various domains.",
    "I have developed skills in implementing system improvements, optimizing performance, and applying agile methodologies in collaborative team settings.",
    "My enthusiasm for technology drives me to explore and experiment with new tools and frameworks in my free time, fueling my continuous growth as a developer.",
    "Some of the technologies I have trained and worked with include (but are not limited to): Dart/Flutter, Python, Java, Prolog, Firebase, and Spring Boot."
  ],

  "Experience.Title": "Experience",
  "Experience.Jobs": [
    {
      "Tab": "Mobile App Project",
      "Title": "Mobile App Developer",
      "Date": "Current",
      "Description": [
        "Developed a mobile app using Dart/Flutter integrated with Firebase for real-time data storage.",
        "Implemented a secure CAPTCHA mechanism for user authentication.",
        "Designed and implemented a multi-type questionnaire system with dynamic functionalities.",
        "Applied agile methodologies to manage tasks and milestones."
      ]
    },
    {
      "Tab": "Face Aging AI Project",
      "Title": "AI Developer",
      "Date": "2024",
      "Description": [
        "Utilized GANs and Convolutional Neural Networks (CNNs) for face aging and editing.",
        "Developed a user-friendly interface using Flask for interaction with AI models.",
        "Integrated JIRA software for task management and collaboration."
      ]
    },
    {
      "Tab": "Healthy Lifestyle Assistant",
      "Title": "AI Rule-Based System Developer",
      "Date": "Current",
      "Description": [
        "Designed a Prolog-based system to establish and monitor healthy lifestyle rules.",
        "Integrated real-time data collection from IoT devices and user inputs.",
        "Developed a responsive front-end in Flutter to visualize health metrics and notifications."
      ]
    }
  ],

  "FeatureProjects.Title": "My Projects",
  "FeatureProjects.Label": "Highlighted Project",
  "FeatureProjects.Projects": [
    {
      "Title": "Face Aging Application",
      "Description": "Developed an AI-powered tool for face editing and aging simulations using GANs and CNNs. The project involved Python (PyTorch), Flask for the web interface, and JIRA for agile project management.",
      "imgs": ["assets/images/face-aging.png"],
      "Technologies": ["Python", "GANs", "Flask", "PyTorch", "JIRA"]
    },
    {
      "Title": "Mobile App with Firebase",
      "Description": "A real-time mobile app integrating Firebase for authentication and data storage, CAPTCHA for security, and a questionnaire system with multi-type question support.",
      "imgs": ["assets/images/mobile-app.png"],
      "Technologies": ["Dart", "Flutter", "Firebase", "SASS"]
    },
    {
      "Title": "Healthy Lifestyle Assistant",
      "Description": "AI-driven Prolog application that tracks daily routines and ensures adherence to user-defined health rules. Includes a dashboard for monitoring and insights.",
      "imgs": ["assets/images/healthy-lifestyle.png"],
      "Technologies": ["Prolog", "Flutter", "Firebase", "IoT"]
    }
  ],

  "OtherProjects.Title": "More Projects",
  "OtherProjects.Projects": [
    {
      "Title": "Motus Game",
      "Description": "Implemented a word-guessing game in Java, focusing on logic and UI design. Used object-oriented programming principles.",
      "imgs": ["assets/images/motus.png"],
      "Technologies": ["Java", "Swing", "OOP"]
    },
    {
      "Title": "CSR Academic Report",
      "Description": "Authored a comprehensive report on Corporate Social Responsibility based on experiences at Crédit Agricole de Lorraine.",
      "imgs": ["assets/images/csr.png"],
      "Technologies": ["MS Word", "Presentation Design"]
    }
  ],

  "Contact.Pretitle": "And... Now?",
  "Contact.Title": "Say Hi!",
  "Contact.Content": "I am eager to collaborate on innovative projects or discuss internship opportunities. Reach out, and I’ll get back to you promptly.",
  "Contact.Btn": "Contact Me"
}