{
  "Header.Item1": "À propos de moi",
  "Header.Item2": "Expériences",
  "Header.Item3": "Projets",
  "Header.Item4": "Contact",
  "Header.cvBtn": "CV",
  "Header.cvName": "CV_NomPrenom.pdf",

  "Banner.Pretitle": "Bonjour ! Je m'appelle",
  "Banner.Description": "Avec mon expérience dans le développement d'applications web et mobiles, je suis passionné par la création de solutions innovantes en utilisant des technologies modernes comme <span class='underline'>Angular</span>, <span class='underline'>Spring Boot</span> et <span class='underline'>Firebase</span>. Mon objectif est de développer des outils utiles et performants tout en appliquant des pratiques de développement de qualité.",
  "Banner.ActionBtn": "Dis Bonjour",

  "AboutMe.Title": "À propos de moi",
  "AboutMe.Paragraphs": [
    "En tant qu'étudiant en dernière année d'ingénierie logicielle, j'ai acquis une expertise en <span class='underline'>développement fullstack</span>, <span class='underline'>apprentissage machine</span> et <span class='underline'>analyse de données</span>. Mes projets m'ont permis d'explorer des domaines variés tels que les applications mobiles, les systèmes intelligents et les interfaces utilisateur.",
    "Mon travail combine des compétences techniques et une approche collaborative, essentielle dans la réalisation de projets innovants. J'aime résoudre des problèmes complexes tout en concevant des solutions adaptées et évolutives.",
    "Voici quelques-unes des technologies avec lesquelles je travaille : <span class='underline'>Java</span>, <span class='underline'>Dart Flutter</span>, <span class='underline'>Firebase</span>, <span class='underline'>Angular</span>, <span class='underline'>Prolog</span>, et bien d'autres."
  ],

  "Experience.Title": "Expériences",
"Experience.Jobs": [
  {
    "Tab": "Projet Application Mobile",
    "Title": "Développeur d'Application Mobile",
    "Date": "Actuel",
    "Description": [
      "Développement d'une application mobile avec Dart/Flutter intégrée à Firebase pour le stockage de données en temps réel.",
      "Mise en place d'un mécanisme CAPTCHA sécurisé pour l'authentification des utilisateurs.",
      "Conception et implémentation d'un système de questionnaire multi-types avec des fonctionnalités dynamiques.",
      "Application des méthodologies agiles pour gérer les tâches et les jalons."
    ]
  },
  {
    "Tab": "Projet IA ",
    "Title": "Développeur IA",
    "Date": "2024",
    "Description": [
      "Utilisation de GANs et de réseaux neuronaux convolutifs (CNN) pour le vieillissement et l'édition faciale.",
      "Développement d'une interface utilisateur conviviale avec Flask pour interagir avec les modèles IA.",
      "Intégration de JIRA pour la gestion des tâches et la collaboration."
    ]
  },
  {
    "Tab": "Assistant Mode de Vie Sain",
    "Title": "Développeur Système Basé sur Règles IA",
    "Date": "Actuel",
    "Description": [
      "Conception d'un système basé sur Prolog pour établir et surveiller des règles de mode de vie sain.",
      "Intégration de la collecte de données en temps réel à partir de dispositifs IoT et des saisies utilisateur.",
      "Développement d'un front-end réactif en Flutter pour visualiser les métriques de santé et les notifications."
    ]
  }
],

  "FeatureProjects.Title": "Mes Projets",
  "FeatureProjects.Label": "Projet Principal",
  "FeatureProjects.Projects": [
    {
      "Title": "Application de Mode de Vie Sain",
      "Description": "Développement d'une application utilisant <span class='underline'>Prolog</span> pour fournir des conseils de santé personnalisés. Le projet intègre des règles complexes et des interfaces utilisateur intuitives.",
      "imgs": ["image1.png", "image2.png"],
      "Technologies": ["Prolog", "Flutter", "Firebase"]
    },
    {
      "Title": "Motus",
      "Description": "Reproduction du jeu 'Motus' en <span class='underline'>Java</span>. Implémentation d'une interface utilisateur simple et intuitive pour améliorer l'expérience utilisateur.",
      "imgs": ["image3.png", "image4.png"],
      "Technologies": ["Java", "Swing"]
    }
  ],

  "Contact.Pretitle": "Et maintenant ?",
  "Contact.Title": "Dis Bonjour !",
  "Contact.Content": "Je suis toujours à la recherche de nouvelles opportunités pour contribuer à des projets innovants. Envoyez-moi un message et je serai ravi d'échanger avec vous !",
  "Contact.Btn": "Me Contacter"
}